.emacs.d/Desktop.org
#+title: Emacs Desktop Environment
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/lisp/pg-desktop.el

* Fonts

The ~xsettingsd~ configuration file. Below is the table for each property:

| Name                          | Type    | Description                    | Values                                     |
|-------------------------------+---------+--------------------------------+--------------------------------------------|
| Gtk/CursorThemeName           | string  | Cursor theme                   | Subdirs of =/usr/share/icons=                |
| Net/EnableEventSounds         | integer | Play event sounds              | 0 (no), 1 (yes)                            |
| Net/EnableInputFeedbackSounds | integer | Event sounds response to input | 0 (no), 1 (yes)                            |
| Net/IconThemeName             | string  | Icon theme                     | Subdirs of =/usr/share/icons=                |
| Net/SoundThemeName            | string  | Sound theme                    |                                            |
| Net/ThemeName                 | string  | Widget theme                   | Subdirs of =/usr/share/themes=               |
| Xft/Antialias                 | integer | Text antialiasing              | 0 (no), 1 (yes), -1 (default)              |
| Xft/DPI                       | integer | Display DPI                    | 1024*dots/inch, -1 (default)               |
| Xft/HintStyle                 | string  | Text hinting style             | hintnone, hintslight, hintmedium, hintfull |
| Xft/Hinting                   | integer | Text hinting                   | 0 (no), 1 (yes), -1 (default)              |
| Xft/RGBA                      | string  | Text subpixel rendering        | none, rgb, bgr, vrgb, vbgr                 |

#+begin_src conf :tangle ~/.config/xsettingsd/xsettingsd.conf

  Gtk/DecorationLayout "menu:minimize,maximize,close"
  Gtk/FontName "Cantarell 12"
  Gtk/MonospaceFontName "Fira Mono 12"
  Gtk/CursorThemeName "Adwaita"
  Net/IconThemeName "Papirus-Dark"
  Net/ThemeName "Matcha-dark-azul"
  Xft/Antialias 1
  Xft/Hinting 0
  Xft/HintStyle "hintnone"
        
#+end_src

Make sure Emacs can find the font path from the ~desktop~ profile:

#+begin_src xml :tangle ~/.config/fontconfig/fonts.conf

  <?xml version="1.0"?>
  <!DOCTYPE fontconfig SYSTEM "fonts.dtd">
  <fontconfig>
    <dir>~/.guix-extra-profiles/desktop/desktop/share/fonts</dir>
    <alias>
      <family>Apple Color Emoji</family>
      <prefer>
        <family>Noto Color Emoji</family>
      </prefer>
    </alias>
  </fontconfig>

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; Settin gs Manager
  "xsettingsd"

  ;; GTK Themes
  "arc-icon-theme"
  "matcha-theme"
  "hicolor-icon-theme"
  "gnome-icon-theme"
  "gnome-backgrounds"
  "papirus-icon-theme"
  "breeze-icons"

  ;; Fonts
  "font-fira-code"
  "font-jetbrains-mono"
  "font-iosevka"
  "font-iosevka-aile"
  "font-abattis-cantarell"
  "font-dejavu"
  "font-google-noto"
  "font-gnu-freefont"
  "font-liberation"
  "font-awesome"
  "font-google-material-design-icons"
  "gs-fonts"

#+end_src

* Window Management

Various settings and packages to alllow emacs to act as the operating system.

** Package | exwm

Many useful keybindings to know:

Managing windows:
- ~M-&~ - Launch a process asy/nchronously
- ~s-t~ - Binding from EXWM to launch without popup
- ~exwm-floating-toggle-floating~ - Floating windows
- ~exwm-layout-toggle-fullscreen~ - Fullscreen
- ~s-SPC~ - Select an app to open

Workspaces:
- ~s-(0-9)~ - Switch to numbered workspace (~~~ can also be used instead of ~0~)
- ~s-w~ - Workspace selector
- ~C-c RET~ - Move window to numbered workspace (EXWM windows are attached to a single workspace)
- ~C-x B~ - Move to any buffer across all workspaces

#+begin_src emacs-lisp

  ;; Sets buffer names to be app names
  (defun pg/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (defun pg/set-wallpaper ()
    (interactive)
    (start-process-shell-command "feh" nil "feh --bg-scale ~/Pictures/ferdinand-stohr-NFs6dRTBgaM-unsplash.jpg"))
    ;; (start-process-shell-command "feh" nil "feh --bg-scale /usr/share/backgrounds/System76-Fractal_Mountains-by_Kate_Hazen_of_System76.png"))

  ;; Some configurations to do per application
  (defun pg/configure-window-by-class ()
    (pcase exwm-class-name
      ("qutebrowser" (exwm-layout-hide-mode-line))
      ("mpv" (exwm-layout-hide-mode-line))
      ("PPSSPPSDL" (exwm-layout-hide-mode-line))
      ("edu-mit-csail-sdg-alloy4whole-Alloy" (exwm-layout-hide-mode-line))))

  ;; Runs a process in the background
  (defun pg/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

  ;; For managing multiple displays
  (defun pg/update-displays ()
    (interactive)
    (pg/run-in-background "autorandr --change --force")
    ;; Change this with respect to the different screen configuration
    ;; Check arandr for display names
    (setq exwm-randr-workspace-monitor-plist
          (pcase (shell-command-to-string "autorandr --detected")
            ("work\n" '(5 "HDMI-1"))
            ("work+\n" '(5 "HDMI-1"))
            ("jclab\n" '(5 "HDMI-1"))
            ("aa-1140\n" '(5 "HDMI-1"))
            ("rg-e310\n" '(5 "HDMI-1"))
            ("jc-s139\n" '(5 "HDMI-1"))
            ("jc-s1139\n" '(5 "DP-1"))
            ("entertainment\n" '(5 "HDMI-1"))))
    (pg/set-wallpaper)
    (message "Display config: %s"
             (string-trim (shell-command-to-string "autorandr --current"))))

  ;; Some initializations
  (defun pg/exwm-startup ()
    (pg/start-panel)
    (pg/run-in-background "dunst")
    (pg/run-in-background "nm-applet")
    (pg/run-in-background "pasystray")
    (pg/run-in-background "udiskie -t"))

  (require 'exwm-config)
  (require 'exwm-randr)
  (use-package exwm
    :straight nil
    :custom
    (exwm-manage-configurations
     '(((string-equal exwm-class-name "Nyxt")
        char-mode t)))
    :config
    ;; Set the default number of workspaces
    (setq exwm-workspace-number 6)

    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'pg/exwm-update-class)

    ;; When exwm starts up
    (add-hook 'exwm-init-hook #'pg/exwm-startup)

    ;; Configure launching of some x windows
    (add-hook 'exwm-manage-finish-hook #'pg/configure-window-by-class)

    ;; Configure some keybindings
    (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")

    ;; Display all buffers across all workspaces when switching
    (setq exwm-workspace-show-all-buffers t)


    ;; Smart display adaptation
    (add-hook 'exwm-randr-screen-change-hook #'pg/update-displays)
    (pg/update-displays)

    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\C-g
            ?\C-h
            ?\M-x
            ?\M-`
            ?\M-&
            ?\M-:
            ?\C-\s ;; C-SPC
            M-tab))

    ;; C-q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; Set up global key bindings.  These always work, no matter the input state!
    ;; Keep in mind that changing this list after EXWM initializes has no effect.
    (setq exwm-input-global-keys
          ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
          `(([?\s-r] . exwm-reset)

            ;; Switch between char and line mode
            ([?\s-s] . exwm-input-toggle-keyboard)

            ;; Launch applications via shell command
            ([?\s-t] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; Switch workspace
            ([?\s-w] . exwm-workspace-switch)

            ;; Bind the tilde key to workspace 0 when switching/creating
            ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

            ;; 's-N': Switch to certain workspace with Super plus a number key (0 - 9)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))

    (exwm-input-set-key (kbd "s-SPC") 'app-launcher-run-app)
    (exwm-randr-enable)
    (exwm-enable)
    :bind (("C-x B" . exwm-workspace-switch-to-buffer)))


#+end_src

** Package | desktop-environment

Allows for some of the keybindings to use while in exwm.

#+begin_src emacs-lisp

  (use-package desktop-environment
    :straight nil
    :after exwm
    :diminish desktop-environment-mode
    :config
    (desktop-environment-mode)
    (unbind-key "<XF86AudioPlay>" 'desktop-environment-mode-map)
    :custom
    (desktop-environment-brightness-normal-increment "5%+")
    (desktop-environment-brightness-normal-decrement "5%-"))

#+end_src

** Desktop environment

It is necessary to run the following command for creating a sym link for the below file:
~sudo ln -f ~~/.emacs.d/exwm/EXWM.desktop /usr/share/xsessions/EXWM.desktop~

#+begin_src conf :tangle ~/.emacs.d/exwm/EXWM.desktop :mkdirp yes

  [Desktop Entry]
  Name=EXWM
  Comment=Emacs Window Manager
  Exec=sh /home/phil-gab99/.emacs.d/exwm/start-exwm.sh
  TryExec=sh
  Type=Application
  X-LightDM-DesktopName=exwm
  DesktopNames=exwm

#+end_src

** Xsession

How the launcher script will be called. Do not forget to make the symlink to the file if there is no need to pass by the gnome WM:

=ln -sf ~/.dotfiles/.xsession ~/.xsession=

#+begin_src sh  :tangle ~/.dotfiles/.xsession :shebang #!/bin/sh

  ~/.emacs.d/exwm/start-exwm.sh

#+end_src

