.emacs.d/lisp/pg-desktop.el

(defun pg/dunstctl (cmd)
  (start-process-shell-command "dunstctl" nil (concat "dunstctl " cmd)))

(exwm-input-set-key (kbd "s-n") (lambda () (interactive) (pg/dunstctl "history-pop")))
(exwm-input-set-key (kbd "s-c") (lambda () (interactive) (pg/dunstctl "close")))

(defun pg/disable-desktop-notifications ()
  (interactive)
  (start-process-shell-command "notify-send" nil "notify-send \"DUNST_COMMAND_PAUSE\""))

(defun pg/enable-desktop-notifications ()
  (interactive)
  (start-process-shell-command "notify-send" nil "notify-send \"DUNST_COMMAND_RESUME\""))
