.emacs.d/lisp/pg-desktop.el

(provide 'pg-desktop)
